[{
        "by": "Imam Ghazali",
        "quote": "Knowledge without action is vanity, and action without knowledge is insanity."
    },
    {
        "by": "Imam Ghazali",
        "quote": "Using his powers to attain to knowledge can raise him up to the ranks of Angels. Following desire he is brought down to the level of beasts."
    },
    {
        "by": "Imam Ghazali",
        "quote": " Dear seeker, you will not be able to rise to carry out the commands of Allah until you monitor your heart and limbs in every moment and every breath."
    },
    {
        "by": "Imam Ghazali",
        "quote": "Advice is easy, what is difficult is accepting it, for it is bitter in taste."
    },
    {
        "by": "Imam Ghazali",
        "quote": "The tongue is very small and light but it can take you to the greatest heights and it can put you in the lowest depths."
    },
    {
        "by": "Imam Ghazali",
        "quote": "Soft words soften the hearts that are harder than rock, harsh words harden hearts that are softer than silk."
    },
    {
        "by": "Imam Ghazali",
        "quote": "The hypocrite looks for faults; the believer looks for excuses."
    },
    {
        "by": "Imam Ghazali",
        "quote": "Declare your jihad on thirteen enemies you cannot see egoism, arrogance, conceit, selfishness, greed, lust, intolerance, anger, lying, cheating, gossiping and slandering. If you can master and destroy them, then you will be ready to fight the enemy you can see."
    },
    {
        "by": "Imam Ghazali",
        "quote": "We are creatures that love to blame the external, not realizing that the problem is usually internal."
    },
    {
        "by": "Imam Ghazali",
        "quote": "The first stage of sincerity is that your private and public state should be the same."
    },
    {
        "by": "Imam Ghazali",
        "quote": "As I look back on my life, I realize that every time I thought I was being rejected from something good; I was actually being re-directed to something better. You must convince your heart that whatever God has decreed is most appropriate and most beneficial for you."
    },
    {
        "by": "Imam Ghazali",
        "quote": "Never have I dealt with anything more difficult than my own soul, sometimes it helps me and sometimes it opposes me."
    },
    {
        "by": "Imam Ghazali",
        "quote": " If we had perfect power to determine our destinies, and perfect vision to see the future and know what is best for us, we would choose exactly the fate that Allah has chosen for us."
    },
    {
        "by": "Imam Ghazali",
        "quote": "Do not allow your heart to take pleasure with the praises of people nor be saddened by their condemnation."
    },
    {
        "by": "Imam Ghazali",
        "quote": "To get what you love, you must first be patient with what you hate."
    },
    {
        "by": "Imam Ghazali",
        "quote": "What is destined will reach you, even if it be beneath two mountains."
    },
    {
        "by": "Imam Ghazali",
        "quote": " What is not destined will not reach you, even if it be between your two lips."
    },
    {
        "by": "Imam Ghazali",
        "quote": "To completely trust in God is to be like a child who knows deeply that even if he does not call for the mother, the mother is totally aware of his condition and is looking after him."
    },
    {
        "by": "Imam Ghazali",
        "quote": "Keep company with those who have firm faith, hear from them the learning of sure faith, follow them always, so that your faith may become firm as their faith became firm."
    },
    {
        "by": "Imam Ghazali",
        "quote": "Those who look for seashells will find seashells; Those who open them will find pearls."
    },
    {
        "by": "Imam Ghazali",
        "quote": " Knowledge without action is wastefulness and action without knowledge is foolishness."
    },
    {
        "by": "Imam Ghazali",
        "quote": "When God wishes his slave well, he grants him insight into the faults which lie in his soul."
    },
    {
        "by": "Imam Ghazali",
        "quote": "Know that thankfulness is from the highest of stations, and it is higher than patience and fear and detachment of the world."
    },
    {
        "by": "Imam Ghazali",
        "quote": "The period of waiting patiently for release from suffering is an act of worship/."
    },
    {
        "by": "Imam Ghazali",
        "quote": " O friend, the cloth from which your burial shroud will be cut may have already reached the market and you remain unaware."
    },
    {
        "by": "Imam Ghazali",
        "quote": "If you see Allah, Mighty and Magnificent, holding back this world from you, frequently trying you with adversity and tribulation, know that you hold a great status with Him. Know that He is dealing with you as He does with His Awliya’ and chosen elite, and is watching over you."
    },
    {
        "by": "Imam Ghazali",
        "quote": "Dear friend, Your heart is a polished mirror. You must wipe it dean of the veil of dust that has gathered upon it, because it is destined to reflect the light of divine secrets."
    }
]
